ggoogoo/pic16f876a_test/practice_1.c

// PIC16F876A Configuration Bit Settings

// 'C' source line config statements

// CONFIG
#pragma config FOSC = XT        // Oscillator Selection bits (XT oscillator)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOREN = OFF      // Brown-out Reset Enable bit (BOR disabled)
#pragma config LVP = OFF        // Low-Voltage (Single-Supply) In-Circuit Serial Programming Enable bit (RB3 is digital I/O, HV on MCLR must be used for programming)
#pragma config CPD = OFF        // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
#pragma config WRT = OFF        // Flash Program Memory Write Enable bits (Write protection off; all program memory may be written to by EECON control)
#pragma config CP = OFF         // Flash Program Memory Code Protection bit (Code protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#define _XTAL_FREQ 4000000

void init(){
    TRISA = 0xFF; //input : toggle switch RA1, RA0
    ADCON1= 0b00000111; //PORTA -> digital
    TRISC = 0x00; //output : LED RC5(timer 1), RC4(timer2)
    INTCONbits.PEIE = 1;
    PIE1bits.TMR1IE = 1;
    PIE1bits.TMR2IE = 1;
    TMR1L = 0x98;
    TMR1H = 0x3A;
    T1CONbits.T1CKPS = 0b00;
    T1CONbits.TMR1ON = 1;
    T2CON = 0b00101111;
    
}

void __interrupt() ISR(){
    if(PIE1bits.TMR2IE && PIR1bits.TMR2IF){
        RC4 = ~RC4;
    }
    
    if(PIE1bits.TMR2IE && PIR1bits.TMR2IF){
        RC5 = ~RC5;
    }
    
    PIR1bits.TMR2IF = 0;
    PIR1bits.TMR1IF = 0;
}

void main(void) {
    init();
    ei();
    
    while(1){
        if(RA0 = 1){ //Timer2 RC4
            RC4 = 0;
            PIE1bits.TMR2IE = 0;
        }else
            PIE1bits.TMR2IE = 1;
        
        if(RA1 = 1){
            RC5 = 0;
            PIE1bits.TMR1IE = 0;
        }else
            PIE1bits.TMR1IE = 1;
    }
    
    return;
}
